AilurusFulgenss/iot-internship/week-02-esp32-basic/liv24-pio/src/eth_upload.cpp
#include "eth_upload.h"
#include "esp_log.h"
#include "esp_netif.h"
#include "esp_eth.h"
#include "esp_eth_mac_esp.h"
#include "esp_eth_phy.h"
#include "esp_event.h"
#include "esp_http_server.h"
#include "esp_http_client.h"
#include "esp_spiffs.h"
#include "esp_system.h"
#include "driver/gpio.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "lwip/ip4_addr.h"
#include "bsp/esp32_p4_wifi6_touch_lcd_4b.h"
#include <sys/stat.h>
#include <string.h>
#include <stdio.h>

static const char *TAG = "ETH_UPLOAD";
static bool s_has_logo = false;
static lv_obj_t *s_ip_label = NULL;
static lv_obj_t *s_qr_obj   = NULL;
static esp_eth_handle_t s_eth_handle = NULL;

#define ETH_PHY_POWER_GPIO  51
#define ETH_PHY_ADDR        1

// ── SPIFFS init ───────────────────────────────────────────────────────────────

void eth_upload_init(void)
{
    esp_vfs_spiffs_conf_t conf = {
        .base_path              = "/spiffs",
        .partition_label        = NULL,
        .max_files              = 5,
        .format_if_mount_failed = true
    };
    esp_err_t ret = esp_vfs_spiffs_register(&conf);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "SPIFFS mount failed: %s", esp_err_to_name(ret));
        s_has_logo = false;
        return;
    }
    struct stat st;
    s_has_logo = (stat(ETH_LOGO_SPIFFS, &st) == 0 && st.st_size > 0);
    ESP_LOGI(TAG, "SPIFFS mounted. Logo: %s (%ld bytes)",
             s_has_logo ? "found" : "not found",
             s_has_logo ? (long)st.st_size : 0L);
}

bool eth_upload_has_logo(void)
{
    return s_has_logo;
}

void eth_upload_clear_logo(void)
{
    // Mount SPIFFS if not already mounted, then delete the logo file
    esp_vfs_spiffs_conf_t conf = {
        .base_path              = "/spiffs",
        .partition_label        = NULL,
        .max_files              = 1,
        .format_if_mount_failed = false
    };
    esp_vfs_spiffs_register(&conf);   // ignore error if already mounted
    remove(ETH_LOGO_SPIFFS);
    s_has_logo = false;
    ESP_LOGW(TAG, "Logo cleared from SPIFFS");
}

// ── HTTP handlers ─────────────────────────────────────────────────────────────

static const char HTML[] =
"<!DOCTYPE html>"
"<html lang='en'>"
"<head>"
"<meta name='viewport' content='width=device-width,initial-scale=1'>"
"<title>LIV24 Setup</title>"
"<style>"
"body{background:#0a0a12;color:#eee;font-family:sans-serif;"
"max-width:420px;margin:40px auto;padding:20px;text-align:center}"
"h2{color:#00e5ff;margin:0 0 8px}"
"p{color:#556677;font-size:14px;margin:4px 0}"
"#zone{border:2px dashed #00e5ff;border-radius:16px;padding:36px 20px;"
"margin:20px 0;cursor:pointer;transition:background .2s}"
"#zone.on{background:#00e5ff18}"
"#preview{max-width:180px;max-height:180px;border-radius:12px;"
"display:none;margin:12px auto;border:2px solid #1a2a3a}"
"button{padding:14px 0;background:#00e5ff;color:#111;border:none;"
"border-radius:10px;font-size:16px;font-weight:bold;cursor:pointer;"
"width:100%;margin-top:8px}"
"button:disabled{background:#1a2a3a;color:#445566;cursor:default}"
"#st{margin-top:16px;min-height:22px;font-size:15px;color:#00cc44}"
"</style>"
"</head>"
"<body>"
"<h2>LIV24 Logo Setup</h2>"
"<p>Connected via <b style='color:#00ff88'>Ethernet</b> — upload your logo below.</p>"
"<p style='color:#334455;font-size:12px'>Upload JPEG logo — any size, device auto-scales to 48×48</p>"
"<div id='zone' onclick=\"document.getElementById('f').click()\">"
"<p style='color:#445566'>Tap to choose JPEG file</p>"
"<input type='file' id='f' accept='image/jpeg,.jpg' style='display:none' onchange='picked(this)'>"
"</div>"
"<img id='preview' alt=''>"
"<button id='btn' disabled onclick='doUpload()'>Upload &amp; Restart</button>"
"<div id='st'></div>"
"<script>"
"var file=null;"
"function picked(inp){"
"file=inp.files[0];if(!file)return;"
"var r=new FileReader();"
"r.onload=function(e){"
"var img=document.getElementById('preview');"
"img.src=e.target.result;img.style.display='block';"
"document.getElementById('zone').innerHTML='<p style=\\'color:#00e5ff\\'>'+file.name+'<br><small style=\\'color:#445566\\'>'+Math.round(file.size/1024)+' KB</small></p>';"
"document.getElementById('btn').disabled=false;"
"};"
"r.readAsDataURL(file);"
"}"
"function doUpload(){"
"if(!file)return;"
"var btn=document.getElementById('btn');"
"var st=document.getElementById('st');"
"btn.disabled=true;st.style.color='#00e5ff';st.innerText='Uploading...';"
"fetch('/upload',{method:'POST',headers:{'Content-Type':'image/jpeg'},body:file})"
".then(function(r){return r.text();})"
".then(function(t){st.style.color='#00cc44';st.innerText=t;})"
".catch(function(e){st.style.color='#ff4444';st.innerText='Error: '+e;btn.disabled=false;});"
"}"
"</script>"
"</body>"
"</html>";

static esp_err_t get_root_handler(httpd_req_t *req)
{
    httpd_resp_set_type(req, "text/html");
    return httpd_resp_send(req, HTML, HTTPD_RESP_USE_STRLEN);
}

static esp_err_t post_upload_handler(httpd_req_t *req)
{
    const size_t MAX_SIZE = 512 * 1024;

    if (req->content_len == 0) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Empty file");
        return ESP_FAIL;
    }
    if (req->content_len > MAX_SIZE) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "File too large (max 512 KB)");
        return ESP_FAIL;
    }

    FILE *f = fopen(ETH_LOGO_SPIFFS, "wb");
    if (!f) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "File open failed");
        return ESP_FAIL;
    }

    uint8_t buf[512];
    int remaining = (int)req->content_len;
    bool ok = true;

    while (remaining > 0) {
        int to_read = (remaining < (int)sizeof(buf)) ? remaining : (int)sizeof(buf);
        int received = httpd_req_recv(req, (char *)buf, to_read);
        if (received <= 0) { ok = false; break; }
        if (fwrite(buf, 1, received, f) != (size_t)received) { ok = false; break; }
        remaining -= received;
    }
    fclose(f);

    if (!ok) {
        remove(ETH_LOGO_SPIFFS);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Upload failed");
        return ESP_FAIL;
    }

    ESP_LOGI(TAG, "Logo saved (%d bytes). Restarting...", (int)req->content_len);
    httpd_resp_sendstr(req, "Logo uploaded! Restarting device...");
    vTaskDelay(pdMS_TO_TICKS(300));
    // Stop Ethernet DMA before reset — active EMAC DMA during SW_CPU_RESET
    // overwrites bootloader code in SRAM causing "Illegal instruction" crash.
    if (s_eth_handle) esp_eth_stop(s_eth_handle);
    vTaskDelay(pdMS_TO_TICKS(200));
    esp_restart();
    return ESP_OK;
}

// ── Ethernet event handler ────────────────────────────────────────────────────

static void eth_event_handler(void *arg, esp_event_base_t base,
                               int32_t id, void *data)
{
    if (base == ETH_EVENT) {
        if (id == ETHERNET_EVENT_CONNECTED)
            ESP_LOGI(TAG, "Ethernet link up");
        else if (id == ETHERNET_EVENT_DISCONNECTED)
            ESP_LOGW(TAG, "Ethernet link down");
    } else if (base == IP_EVENT && id == IP_EVENT_ETH_GOT_IP) {
        ip_event_got_ip_t *ev = (ip_event_got_ip_t *)data;
        char ip_str[48];
        snprintf(ip_str, sizeof(ip_str), "http://" IPSTR "/",
                 IP2STR(&ev->ip_info.ip));
        ESP_LOGI(TAG, "Got IP: %s", ip_str);

        if (bsp_display_lock(500)) {
            if (s_qr_obj) {
                lv_qrcode_update(s_qr_obj, ip_str, strlen(ip_str));
                lv_obj_clear_flag(s_qr_obj, LV_OBJ_FLAG_HIDDEN);
            }
            if (s_ip_label)
                lv_label_set_text(s_ip_label, ip_str);
            bsp_display_unlock();
        }
    }
}

// ── Shared Ethernet hardware init ────────────────────────────────────────────

static void eth_hw_start(esp_netif_t *eth_netif)
{
    // Power up IP101 PHY
    gpio_config_t pwr = {};
    pwr.pin_bit_mask = (1ULL << ETH_PHY_POWER_GPIO);
    pwr.mode         = GPIO_MODE_OUTPUT;
    ESP_ERROR_CHECK(gpio_config(&pwr));
    ESP_ERROR_CHECK(gpio_set_level((gpio_num_t)ETH_PHY_POWER_GPIO, 1));
    vTaskDelay(pdMS_TO_TICKS(150));

    // MAC — field-by-field init (ETH_ESP32_EMAC_DEFAULT_CONFIG() macro has wrong field
    // order for C++ designated initializers; values are identical to the P4 defaults).
    eth_esp32_emac_config_t emac_cfg = {};
    emac_cfg.smi_gpio.mdc_num  = 31;
    emac_cfg.smi_gpio.mdio_num = 52;
    emac_cfg.interface         = EMAC_DATA_INTERFACE_RMII;
    emac_cfg.clock_config.rmii.clock_mode = EMAC_CLK_EXT_IN;
    emac_cfg.clock_config.rmii.clock_gpio = (emac_rmii_clock_gpio_t)50;
    emac_cfg.dma_burst_len     = ETH_DMA_BURST_LEN_32;
    emac_cfg.intr_priority     = 0;
    emac_cfg.emac_dataif_gpio.rmii.tx_en_num  = 49;
    emac_cfg.emac_dataif_gpio.rmii.txd0_num   = 34;
    emac_cfg.emac_dataif_gpio.rmii.txd1_num   = 35;
    emac_cfg.emac_dataif_gpio.rmii.crs_dv_num = 28;
    emac_cfg.emac_dataif_gpio.rmii.rxd0_num   = 29;
    emac_cfg.emac_dataif_gpio.rmii.rxd1_num   = 30;
    emac_cfg.clock_config_out_in.rmii.clock_mode = EMAC_CLK_EXT_IN;
    emac_cfg.clock_config_out_in.rmii.clock_gpio = (emac_rmii_clock_gpio_t)-1;
    emac_cfg.mdc_freq_hz = 0;
    eth_mac_config_t mac_cfg = ETH_MAC_DEFAULT_CONFIG();
    eth_phy_config_t phy_cfg = ETH_PHY_DEFAULT_CONFIG();
    phy_cfg.phy_addr       = ETH_PHY_ADDR;
    phy_cfg.reset_gpio_num = -1;

    esp_eth_mac_t   *mac = esp_eth_mac_new_esp32(&emac_cfg, &mac_cfg);
    esp_eth_phy_t   *phy = esp_eth_phy_new_ip101(&phy_cfg);
    esp_eth_config_t eth_cfg = ETH_DEFAULT_CONFIG(mac, phy);
    ESP_ERROR_CHECK(esp_eth_driver_install(&eth_cfg, &s_eth_handle));
    ESP_ERROR_CHECK(esp_netif_attach(eth_netif, esp_eth_new_netif_glue(s_eth_handle)));
    ESP_ERROR_CHECK(esp_eth_start(s_eth_handle));
}

// ── Normal-mode Ethernet (MQTT background) ───────────────────────────────────

bool eth_logo_fetch_from_url(const char *url)
{
    ESP_LOGI(TAG, "Fetching logo from: %s", url);
    esp_http_client_config_t cfg = {};
    cfg.url         = url;
    cfg.timeout_ms  = 15000;
    cfg.buffer_size = 1024;

    esp_http_client_handle_t client = esp_http_client_init(&cfg);
    if (!client) return false;

    if (esp_http_client_open(client, 0) != ESP_OK) {
        esp_http_client_cleanup(client);
        return false;
    }

    int content_len = esp_http_client_fetch_headers(client);
    int status      = esp_http_client_get_status_code(client);
    ESP_LOGI(TAG, "Logo fetch: HTTP %d  len=%d", status, content_len);

    if (status != 200 || content_len <= 0 || content_len > 512 * 1024) {
        esp_http_client_cleanup(client);
        return false;
    }

    FILE *f = fopen(ETH_LOGO_SPIFFS, "wb");
    if (!f) { esp_http_client_cleanup(client); return false; }

    char buf[512];
    int total = 0, rlen;
    while ((rlen = esp_http_client_read(client, buf, sizeof(buf))) > 0) {
        fwrite(buf, 1, rlen, f);
        total += rlen;
    }
    fclose(f);
    esp_http_client_close(client);
    esp_http_client_cleanup(client);

    if (total < 10) { remove(ETH_LOGO_SPIFFS); return false; }

    s_has_logo = true;
    ESP_LOGI(TAG, "Logo saved: %d bytes → %s", total, ETH_LOGO_SPIFFS);
    return true;
}

void eth_start_background(void)
{
    ESP_LOGI(TAG, "Starting Ethernet (background / MQTT mode)...");
    // esp_netif_init() + esp_event_loop_create_default() called once in app_main.
    esp_netif_config_t netif_cfg = ESP_NETIF_DEFAULT_ETH();
    esp_netif_t *eth_netif = esp_netif_new(&netif_cfg);

#ifdef STATIC_IP_ADDR
    // Stop DHCP and use static IP (set STATIC_IP_ADDR / STATIC_GW_ADDR /
    // STATIC_MASK_ADDR in platformio.ini build_flags when DHCP doesn't work).
    esp_netif_dhcpc_stop(eth_netif);   // ignore error if already stopped
    esp_netif_ip_info_t ip_info = {};
    ip4addr_aton(STATIC_IP_ADDR,   (ip4_addr_t *)&ip_info.ip);
    ip4addr_aton(STATIC_GW_ADDR,   (ip4_addr_t *)&ip_info.gw);
    ip4addr_aton(STATIC_MASK_ADDR, (ip4_addr_t *)&ip_info.netmask);
    ESP_ERROR_CHECK(esp_netif_set_ip_info(eth_netif, &ip_info));

    ESP_LOGI(TAG, "Static IP: " IPSTR "  mask " IPSTR "  gw " IPSTR,
             IP2STR(&ip_info.ip), IP2STR(&ip_info.netmask), IP2STR(&ip_info.gw));
    // DNS is configured in wifi_mqtt eth_got_ip_handler after link-up
#endif

    ESP_ERROR_CHECK(esp_event_handler_register(ETH_EVENT, ESP_EVENT_ANY_ID,
                                               eth_event_handler, NULL));
    ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT, IP_EVENT_ETH_GOT_IP,
                                               eth_event_handler, NULL));
    eth_hw_start(eth_netif);
#ifdef STATIC_IP_ADDR
    ESP_LOGI(TAG, "Ethernet started — static IP configured.");
#else
    ESP_LOGI(TAG, "Ethernet started — waiting for DHCP lease...");
#endif
}

// ── Setup-mode Ethernet + HTTP upload server ──────────────────────────────────

void eth_upload_start(lv_obj_t *qr_obj, lv_obj_t *ip_label)
{
    s_ip_label = ip_label;
    s_qr_obj   = qr_obj;
    ESP_LOGI(TAG, "Starting Ethernet (upload mode)...");
    // esp_netif_init() + esp_event_loop_create_default() called once in app_main.

    esp_netif_config_t netif_cfg = ESP_NETIF_DEFAULT_ETH();
    esp_netif_t *eth_netif = esp_netif_new(&netif_cfg);

    ESP_ERROR_CHECK(esp_event_handler_register(ETH_EVENT,  ESP_EVENT_ANY_ID,    eth_event_handler, NULL));
    ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT,   IP_EVENT_ETH_GOT_IP, eth_event_handler, NULL));

    eth_hw_start(eth_netif);

    ESP_LOGI(TAG, "Ethernet started — waiting for IP (DHCP)...");

    // Start HTTP server immediately; accessible once IP assigned
    httpd_handle_t server = NULL;
    httpd_config_t http_cfg = HTTPD_DEFAULT_CONFIG();
    http_cfg.stack_size       = 8192;
    http_cfg.max_uri_handlers = 4;

    if (httpd_start(&server, &http_cfg) != ESP_OK) {
        ESP_LOGE(TAG, "HTTP server start failed");
        return;
    }

    httpd_uri_t uri_root   = { "/",       HTTP_GET,  get_root_handler,    NULL };
    httpd_uri_t uri_upload = { "/upload", HTTP_POST, post_upload_handler, NULL };
    httpd_register_uri_handler(server, &uri_root);
    httpd_register_uri_handler(server, &uri_upload);

    ESP_LOGI(TAG, "HTTP server ready — waiting for upload");

    while (1) {
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}
